/*
Strict-Equality(===) คือการเปรียบเทียบค่าที่ตรวจทั้ง Value และ Type ผลลัพธ์จะเป็นTrue ก็ต่อเมื่อ ทั้งสองค่าตรงกัน   
*/

//เปรียบเทียบระหว่าง == / ===
console.log(5 == "5");//Return True เพราะ == จะพยายามแปลงข้อมูลอัตโนมัติก่อน
console.log(5 === "5"); //Return False เพราะว่าTypeไม่ตรงกัน

console.log(5 === 5 ); //Return True เพราะ Value และ Type ตรงกัน

//Strict-Inquality(!==) ตรงข้ามกัน คือ Value กับ Type ตรงกันจะ Return false

console.log(5 !== 5); //Return false เพราะทั้งสองค่าตรงกัน
console.log(5 !== "5"); //Return True เพราะTypeไม่ตรงกัย

/*
เอาไว้ใช้ตอนไหน
-ใช้เมื่อต้องการความถูกต้องแม่นยำ เช่น การเช็ค Password , Login 
-ตรวจค่าInputของผู้ใช้
-ป้องกันบัคเวลาใช้ ==

*/


// == ส่วนใหญ่จะใช้กรณีที่เรายอมรับได้ว่าข้อมูลจะเป็นประเภทไหนก็ได้  ใช้เมื่ออยากให้แปลงข้อมูล