//Do Loop จะทำก่อน1ครั้งแล้วค่อยเช็คเงื่อนไข

/*
สถานการณ์ที่ควรใช้ Do loop 
-การรับค่าจากUser ด้วย prompt
-ใช้ใน game condition
*/

/*
do{
    //โค้ดที่ให้ทำงานก่อนในรอบแรกและทำซ่ำถ้าเงื่อนไขเป็นจรืง
    //ควรมีตัวเพิ่มค่าเสมอ
} while(condition); //ต้องมีsemicolon(;)ปิดท้ายเสมอ
*/

//Ex1
let i = 1;

do{
    console.log("Round : " + i);
    i++;
} while(i <= 3);


//Ex2 เมื่อเงื่อนไขเป็นเท็จตั้งแต่เริม

let y = 10;

do{
    console.log("Value of y is " + y);
    y++;
} while(y < 5);

//โปรแกรมจะทำงานก่อน1ครั้ง หลังจากนั้นเพราะเงื่อนไขเป็นเท็จจึงจบการทำงานของ while loop


