//Break//
/*
Braekใน for loop เมื่อเจอ Break มันจะตัดจบการทำงานของloomyomu
แล้วออกไปทำโค้ดบรรทัดที่อยู่ถัดไปนอกloop
*/

for (let i = 1; i <= 5; i++){
    if (i === 3){
        console.log("found a Number 3 Use Break!");
        break;
    }
    console.log("Round : " + i);
}

console.log("Loop Exist!");

//Continue
/*
ใช้ข้ามรอบปัจจุบัน มันจะช้ามโค้ดส่วนที่เหลือในปีกกาเฉพาะของรอบนั้นๆทันที
แล้วกระโดดกลับไปที่สวน การเปลี่ยนแปลงค่า(i++) เพื่อเพิ่มค่าตัวแปร แล้วเช็กเงื่อนไชเริ่มรอบถัดไป
loop จะยังดำเนินต่อไป
*/

for (let i =1; i <= 5; i++){
    if(i === 3){
        console.log("Found number3! But i will skip!");
        continue; //ข้าม console.log ด้านล่างไปเลย แล้วกระโดดไปที่ i++ เพื่อเริ่มรอบที่ 4
    }
    console.log("Number : " + i);
}

/*
    Continueมักจะถูกนำมาใช้ในสถานการณ์ที่เรียกว่า "การกรองข้อมูล(Filtering)"
    -ข้ามข้อมูลบางประเภทที่ไม่ต้องการประมวลผล
    -แยกการทำงานเฉพาะเลขคู่ หรือ เลขคี่ 
    -ทำความสะอาดข้อมูล
 */